DocumentJournals/ДокументыПоОплатам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоОплатам</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПоступлениеВКассу</xr:Item>
				<xr:Item>Document.ПоступлениеНаСчет</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступлениеВКассу.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеНаСчет.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<References>
						<xr:Item>Document.ПоступлениеВКассу.Attribute.ЛицевойСчет</xr:Item>
						<xr:Item>Document.ПоступлениеНаСчет.Attribute.ЛицевойСчет</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗданияИСооружения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МобТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКвартир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЖивут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетСпецКомунТранс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетТеплосеть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндОтопление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЖЕК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Другое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DocumentJournals/ДокументыПоОплатам/Forms/ФормаСписка/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ   
//

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Строка Из Метаданные.ЖурналыДокументов.ДокументыПоОплатам.РегистрируемыеДокументы Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(Строка.Синоним, Строка.Синоним);
		ТипыДокументов.Добавить(Строка.Синоним, Строка.Имя);
	КонецЦикла;
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборОрганизация		 		= Настройки.Получить("ОтборОрганизация");
	ТипДокументаПредставление 		= Настройки.Получить("ТипДокументаПредставление");
	ОтборЗдание						= Настройки.Получить("ОтборЗдание");
	ОтборЛицевойСчет				= Настройки.Получить("ОтборЛицевойСчет");
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	УстановитьСвязиПараметровВыбора();
	
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
    ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.Владелец", ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДСервер.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет", ОтборЛицевойСчет, ЗначениеЗаполнено(ОтборЛицевойСчет));
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура УстановитьОтбор()
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Организация",	ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет.Владелец",		ОтборЗдание, ЗначениеЗаполнено(ОтборЗдание));
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "ЛицевойСчет",		ОтборЛицевойСчет, ЗначениеЗаполнено(ОтборЛицевойСчет));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТипДокумента.
// 
Процедура ТипДокументаПриИзменении(Элемент)
	
	ВыбранныйТипДокумента = ТипыДокументов.НайтиПоЗначению(ТипДокументаПредставление);
	Если ВыбранныйТипДокумента = Неопределено Тогда
		ТипДокумента = "";
	Иначе
		ТипДокумента = ВыбранныйТипДокумента.Представление;
	КонецЕсли;
	
	ОСМДКлиент.ИзменитьЭлементОтбораСписка(Список, "Тип", ?(ЗначениеЗаполнено(ТипДокумента), Тип("ДокументСсылка." + ТипДокумента), Неопределено), ЗначениеЗаполнено(ТипДокумента));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Здание.
// 
Процедура ЗданиеПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборЛицевойСчетПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Организация.
// 
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьСвязиПараметровВыбора();
	УстановитьОтбор();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "ОтборОрганизация", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЗдание.Организация <> ОтборОрганизация Тогда
			ОтборЗдание = Справочники.ЗданияИСооружения.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЗдание.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборЗдание) Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "ОтборЗдание", РежимИзмененияСвязанногоЗначения.НеИзменять);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		Элементы.ОтборЛицевойСчет.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Если ОтборЛицевойСчет.Владелец <> ОтборЗдание Тогда
			ОтборЛицевойСчет = Справочники.ЛицевыеСчета.ПустаяСсылка();
		КонецЕсли;
	Иначе		
		Элементы.ОтборЛицевойСчет.СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив());
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ЗначениеЗаполнено(ТипДокумента) И НЕ Копирование Тогда
		
		Отказ = Истина;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Здание", ОтборЗдание);
		СтруктураПараметров.Вставить("Организация", ОтборОрганизация);
		СтруктураПараметров.Вставить("ЛицевойСчет", ОтборЛицевойСчет);
		
		ОткрытьФорму("Документ." + ТипДокумента + ".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров));
	КонецЕсли; 
	
КонецПроцедуры
